In [14]:
import pandas as pd 
from io import StringIO
from sklearn.impute import SimpleImputer
import numpy as np

In [15]:
csv_data = '''A,B,C,D 
              1.0,2.0,3.0,4.0
              5.0,6.0,,8.0
              10.0,11.0,12.0,'''
df = pd.read_csv(StringIO(csv_data))

In [16]:
df

      A     B     C   D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

In [6]:
df.isnull().sum()

A     0
B     0
C     1
D     1
dtype: int64

In [9]:
df.dropna(axis=0)

      A     B
0   1.0   2.0
1   5.0   6.0
2  10.0  11.0

In [10]:
df.dropna(axis=1)

      A     B
0   1.0   2.0
1   5.0   6.0
2  10.0  11.0

In [11]:
df.dropna(how='all')

      A     B     C   D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

In [12]:
df.dropna(thresh=4)

     A    B    C   D
0  1.0  2.0  3.0  4.0

In [13]:
df.dropna(subset='C')

      A     B     C   D
0   1.0   2.0   3.0  4.0
2  10.0  11.0  12.0  NaN

In [19]:
imr = SimpleImputer(missing_values=np.nan, strategy='mean')
imr.fit(df.values)
imputed_data = imr.transform(df.values)

In [20]:
imputed_data

array([[ 1. ,  2. ,  3. ,  4. ],
       [ 5. ,  6. ,  7.5,  8. ],
       [10. , 11. , 12. ,  6. ]])

In [21]:
df.fillna(df.mean())

      A     B     C   D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   7.5  8.0
2  10.0  11.0  12.0  6.0